import matplotlib.pyplot as plt

Tvpl = ['5260,0', '6000,0', '6700,0']
Tvov = ['5854,0', '6250,0', '6500,0']
Ttpl = ['3720,0', '3800,0', '4300,0']
Ttov = ['3682,0', '3850,0', '4500,0']
Vdvpl = ['50250,0','17360,0', '18800,0']
Vdvov = ['43905,0', '46875,0', '48750,0']
Vdtpl = ['22895,0', '33250,0', '27900,0']
Vdtov = ['27615,0', '28875,0', '33750,0']
discount = ['7.5', '7.5', '7.5 ']
year =  ['2013', '2014', '2015']

plt.plot(year, Tvpl, Label = 'Товарообіг тис.крб. Взуття(План)')
plt.plot(year, Tvov, Label = 'Товарообіг тис.крб. Взуття(Очіковане виконання)')
plt.plot(year, Ttpl, Label = 'Товарообіг тис.крб. Трикотаж(План)')
plt.plot(year, Ttov, Label = 'Товарообіг тис.крб. Трикотаж(Очіковане виконання)')
plt.plot(year, discount, Label = 'Торгова скидка, %')
plt.plot(year, Vdvpl, Label = 'Валовий доход тис.крб. Взуття(План)')
plt.plot(year, Vdvov, Label = 'Валовий доход тис.крб. Взуття(Очіковане виконання)')
plt.plot(year, Vdtpl, Label = 'Валовий доход тис.крб. Трикотаж(План)')
plt.plot(year, Vdtov, Label = 'Валовий доход тис.крб. Трикотаж(Очіковане виконання)')
plt.xlabel('Рік')
plt.ylabel('Ціна')
plt.legend(['Товарообіг тис.крб. Взуття(План)','Товарообіг тис.крб. Взуття(Очіковане виконання)','Товарообіг тис.крб. Трикотаж(План)',
 'Товарообіг тис.крб. Трикотаж(Очіковане виконання)', 'Торгова скидка, %','Валовий доход тис.крб. Взуття(План)',
 'Валовий доход тис.крб. Взуття(Очіковане виконання)','Валовий доход тис.крб. Трикотаж(План)'
 'Валовий доход тис.крб. Трикотаж(Очіковане виконання)' ],loc='upper left')
plt.grid(True)

def showplot():
    plt.show()